hotRoom9A_shelterBuoy/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            calculated;
        value           $internalField;
    }
    outlet
    {
      type            calculated;
     value           $internalField;
    }
    top
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    bottom
    {
        type            atmNutkWallFunction;
        #include        "ABLConditions";
        value           $internalField;
    }
    side01
    {
        type            symmetry;
    }

    side02
    {
        type            symmetry;
    }
}


// ************************************************************************* //
